; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_71)

(:domain logistics)

(:objects
	obj0 obj3 - airport
	obj1 obj4 - city
	obj2 obj5 - truck
	obj6 obj7 obj8 obj10 obj11 obj14 obj16 - package
	obj9 obj13 - location
	obj12 obj15 - airplane
)

(:init
	(at obj2 obj0)
	(at obj5 obj3)
	(at obj6 obj3)
	(at obj7 obj0)
	(at obj8 obj3)
	(at obj10 obj0)
	(at obj11 obj9)
	(at obj12 obj0)
	(at obj14 obj0)
	(at obj15 obj3)
	(at obj16 obj3)
	(in-city obj0 obj1)
	(in-city obj3 obj4)
	(in-city obj9 obj4)
	(in-city obj13 obj1)
)

(:goal (and
	(at obj6 obj13)
	(at obj7 obj9)
	(at obj8 obj13)
	(at obj10 obj9)
	(at obj11 obj3)
	(at obj14 obj9)
	(at obj16 obj13)
))
)

; plan
1. (drive obj5 obj3 obj9)
   deleted: (at obj5 obj3)
   added: (at obj5 obj9)
   goals met: 0 of 7
2. (load obj12 obj10 obj0)
   deleted: (at obj10 obj0)
   added: (in obj10 obj12)
   goals met: 0 of 7
3. (load obj12 obj14 obj0)
   deleted: (at obj14 obj0)
   added: (in obj14 obj12)
   goals met: 0 of 7
4. (load obj12 obj7 obj0)
   deleted: (at obj7 obj0)
   added: (in obj7 obj12)
   goals met: 0 of 7
5. (fly obj12 obj0 obj3)
   deleted: (at obj12 obj0)
   added: (at obj12 obj3)
   goals met: 0 of 7
6. (drive obj2 obj0 obj13)
   deleted: (at obj2 obj0)
   added: (at obj2 obj13)
   goals met: 0 of 7
7. (drive obj5 obj9 obj3)
   deleted: (at obj5 obj9)
   added: (at obj5 obj3)
   goals met: 0 of 7
8. (load obj12 obj16 obj3)
   deleted: (at obj16 obj3)
   added: (in obj16 obj12)
   goals met: 0 of 7
9. (load obj12 obj6 obj3)
   deleted: (at obj6 obj3)
   added: (in obj6 obj12)
   goals met: 0 of 7
10. (load obj12 obj8 obj3)
   deleted: (at obj8 obj3)
   added: (in obj8 obj12)
   goals met: 0 of 7
11. (unload obj12 obj10 obj3)
   deleted: (in obj10 obj12)
   added: (at obj10 obj3)
   goals met: 0 of 7
12. (unload obj12 obj14 obj3)
   deleted: (in obj14 obj12)
   added: (at obj14 obj3)
   goals met: 0 of 7
13. (unload obj12 obj7 obj3)
   deleted: (in obj7 obj12)
   added: (at obj7 obj3)
   goals met: 0 of 7
14. (fly obj12 obj3 obj0)
   deleted: (at obj12 obj3)
   added: (at obj12 obj0)
   goals met: 0 of 7
15. (drive obj2 obj13 obj0)
   deleted: (at obj2 obj13)
   added: (at obj2 obj0)
   goals met: 0 of 7
16. (load obj5 obj10 obj3)
   deleted: (at obj10 obj3)
   added: (in obj10 obj5)
   goals met: 0 of 7
17. (load obj5 obj14 obj3)
   deleted: (at obj14 obj3)
   added: (in obj14 obj5)
   goals met: 0 of 7
18. (load obj5 obj7 obj3)
   deleted: (at obj7 obj3)
   added: (in obj7 obj5)
   goals met: 0 of 7
19. (unload obj12 obj16 obj0)
   deleted: (in obj16 obj12)
   added: (at obj16 obj0)
   goals met: 0 of 7
20. (unload obj12 obj6 obj0)
   deleted: (in obj6 obj12)
   added: (at obj6 obj0)
   goals met: 0 of 7
21. (unload obj12 obj8 obj0)
   deleted: (in obj8 obj12)
   added: (at obj8 obj0)
   goals met: 0 of 7
22. (drive obj5 obj3 obj9)
   deleted: (at obj5 obj3)
   added: (at obj5 obj9)
   goals met: 0 of 7
23. (load obj2 obj16 obj0)
   deleted: (at obj16 obj0)
   added: (in obj16 obj2)
   goals met: 0 of 7
24. (load obj2 obj6 obj0)
   deleted: (at obj6 obj0)
   added: (in obj6 obj2)
   goals met: 0 of 7
25. (load obj2 obj8 obj0)
   deleted: (at obj8 obj0)
   added: (in obj8 obj2)
   goals met: 0 of 7
26. (load obj5 obj11 obj9)
   deleted: (at obj11 obj9)
   added: (in obj11 obj5)
   goals met: 0 of 7
27. (unload obj5 obj10 obj9)
   deleted: (in obj10 obj5)
   added: (at obj10 obj9)
   goals met: 1 of 7
28. (unload obj5 obj14 obj9)
   deleted: (in obj14 obj5)
   added: (at obj14 obj9)
   goals met: 2 of 7
29. (unload obj5 obj7 obj9)
   deleted: (in obj7 obj5)
   added: (at obj7 obj9)
   goals met: 3 of 7
30. (drive obj2 obj0 obj13)
   deleted: (at obj2 obj0)
   added: (at obj2 obj13)
   goals met: 3 of 7
31. (drive obj5 obj9 obj3)
   deleted: (at obj5 obj9)
   added: (at obj5 obj3)
   goals met: 3 of 7
32. (unload obj2 obj16 obj13)
   deleted: (in obj16 obj2)
   added: (at obj16 obj13)
   goals met: 4 of 7
33. (unload obj2 obj6 obj13)
   deleted: (in obj6 obj2)
   added: (at obj6 obj13)
   goals met: 5 of 7
34. (unload obj2 obj8 obj13)
   deleted: (in obj8 obj2)
   added: (at obj8 obj13)
   goals met: 6 of 7
35. (unload obj5 obj11 obj3)
   deleted: (in obj11 obj5)
   added: (at obj11 obj3)
   goals met: 7 of 7
